class NavigationLocators:
    LOGO__LINK = 'text=""'  # 
    СОБЫТИЯ = 'text="События"'  # События
    РЕЗУЛЬТАТЫ = 'text="Результаты"'  # Результаты
    ЧЕМПИОНАТЫ = 'text="Чемпионаты"'  # Чемпионаты
    ФОТО = 'text="Фото"'  # Фото
    КЛУБЫ = 'text="Клубы"'  # Клубы
    ЭКСПО = 'text="Экспо"'  # Экспо
    ОТЕЛИ = 'text="Отели"'  # Отели
    ЖУРНАЛ = 'text="Журнал"'  # Журнал
    LINK = 'text=""'  # 
    НАЙТИ_РЕЗУЛЬТАТЫ = 'text="Найти результаты"'  # Найти результаты
    BANNER__LINK = 'text=""'  # 
    LINK_67 = 'text="Silk Road – Andijon 2025"'  # Silk Road – Andijon 2025
    XM = 'text="XM"'  # XM
    XASAN_MIRSOATOV = 'text="Xasan Mirsoatov"'  # Xasan Mirsoatov
    RX = 'text="RX"'  # RX
    RUSLAN_XAJIEV = 'text="Ruslan Xajiev"'  # Ruslan Xajiev
    OT = 'text="OT"'  # OT
    OTABEK_TOSHQUVVATOV = 'text="Otabek Toshquvvatov"'  # Otabek Toshquvvatov
    LINK_80 = 'text="XVI ГАТЧИНСКИЙ ПОЛУМАРАФОН"'  # XVI ГАТЧИНСКИЙ ПОЛУМАРАФОН
    ВГ = 'text="ВГ"'  # ВГ
    ВИКТОР_ГУРЖИЙ = 'text="Виктор Гуржий"'  # Виктор Гуржий
    ЕЛ = 'text="ЕЛ"'  # ЕЛ
    ЕГОР_ЛИМОНОВ = 'text="Егор Лимонов"'  # Егор Лимонов
    АЯ = 'text="АЯ"'  # АЯ
    АНДРЕЙ_ЯНОВИЧ = 'text="Андрей Янович"'  # Андрей Янович
    LINK_93 = 'text="Корпоративный забег \\"Энергия жизни\\" Самара 2025"'  # Корпоративный забег "Энергия жизни" Самара 2025
    ДМ = 'text="ДМ"'  # ДМ
    ДЕНИС_МАМАТОВ = 'text="Денис Маматов"'  # Денис Маматов
    МВ = 'text="МВ"'  # МВ
    МАКСИМ_ВОРОНЦОВ = 'text="Максим Воронцов"'  # Максим Воронцов
    МГ = 'text="МГ"'  # МГ
    МИХАИЛ_ГУЛИК = 'text="Михаил Гулик"'  # Михаил Гулик
    EVENT_CARD__LINK = 'text=""'  # 
    EVENT_CARD__LINK_110 = 'text=""'  # 
    EVENT_CARD__LINK_111 = 'text=""'  # 
    EVENT_CARD__LINK_112 = 'text=""'  # 
    OUR_EVENTS__LINK = 'text=""'  # 
    LINK_123 = 'text=""'  # 
    ПЛАТФОРМА = 'text="Платформа"'  # Платформа
    ОЦЕНКА_СОБЫТИЙ = 'text="Оценка событий"'  # Оценка событий
    ЖУРНАЛ_126 = 'text="Журнал"'  # Журнал
    РЕКЛАМА = 'text="Реклама"'  # Реклама
    ВАКАНСИИ = 'text="Вакансии"'  # Вакансии
    КОНТАКТЫ = 'text="Контакты"'  # Контакты
    СОЗДАТЬ_СОБЫТИЕ = 'text="Создать событие"'  # Создать событие
    ВОЗМОЖНОСТИ = 'text="Возможности"'  # Возможности
    УСЛУГИ = 'text="Услуги"'  # Услуги
    НАЙТИ_СОБЫТИЕ = 'text="Найти событие"'  # Найти событие
    РЕЗУЛЬТАТЫ_134 = 'text="Результаты"'  # Результаты
    ЧЕМПИОНАТЫ_135 = 'text="Чемпионаты"'  # Чемпионаты
    ФОТО_136 = 'text="Фото"'  # Фото
    КЛУБЫ_137 = 'text="Клубы"'  # Клубы
    ЭКСПО_138 = 'text="Экспо"'  # Экспо
    ОТЕЛИ_139 = 'text="Отели"'  # Отели
    ЦЕНТР_ПОДДЕРЖКИ = 'text="Центр поддержки"'  # Центр поддержки
    КОНФИДЕНЦИАЛЬНОСТЬ = 'text="Конфиденциальность"'  # Конфиденциальность
    TEXT_SMALL_SEMIBOLD = 'text="Аккредитация в качестве ИТ-компании"'  # Аккредитация в качестве ИТ-компании
    TEXT_SMALL_SEMIBOLD_147 = 'text="Информация о деятельности компании в области ИТ"'  # Информация о деятельности компании в области ИТ
    FOOTER__SOCIAL_LINK = 'text=""'  # 

class ContainersLocators:
    RR_HEADER_NAV = 'text="События Результаты Чемпионаты Фото Клубы Экспо Отели Журнал Ещё"'  # События Результаты Чемпионаты Фото Клубы Экспо Отели Журнал 
    ЕЩЁ = 'text="Ещё"'  # Ещё
    DROPDOWN_POPUP__TRIGGER = 'text=""'  # 
    НАЙТИ_СОБЫТИЕ = 'text="Найти событие"'  # Найти событие
    СОЗДАТЬ_СОБЫТИЕ = 'text="Создать событие"'  # Создать событие
    21_КМ = 'text="21 км"'  # 21 км
    MULTISELECT__ICON = 'text=""'  # 
    21.1_КМ = 'text="21.1 км"'  # 21.1 км
    MULTISELECT__ICON_82 = 'text=""'  # 
    MULTISELECT = 'text="10 км ( только мужчины)"'  # 10 км ( только мужчины)
    MULTISELECT__ICON_95 = 'text=""'  # 
    СМ._ВСЕ = 'text="См. все"'  # См. все
    СОЗДАТЬ_СОБЫТИЕ_121 = 'text="Создать событие"'  # Создать событие
    FOOTER = 'text="О нас Платформа Оценка событий Журнал Реклама Вакансии Контакты Организатору Создать событие Возможности Услуги Участник"'  # О нас Платформа Оценка событий Журнал Реклама Вакансии Конта
    РУССКИЙ = 'text="Русский"'  # Русский

class ButtonsLocators:
    ЕЩЁ = 'text="Ещё"'  # Ещё
    COMPACT_VARIANT__TRIGGER = 'text=""'  # 
    AVATAR = 'text=""'  # 
    XM = 'text="XM"'  # XM
    RX = 'text="RX"'  # RX
    OT = 'text="OT"'  # OT
    ВГ = 'text="ВГ"'  # ВГ
    ЕЛ = 'text="ЕЛ"'  # ЕЛ
    АЯ = 'text="АЯ"'  # АЯ
    ДМ = 'text="ДМ"'  # ДМ
    МВ = 'text="МВ"'  # МВ
    МГ = 'text="МГ"'  # МГ
    SWIPER_NAVIGATION = 'text=""'  # 
    SWIPER_NAVIGATION_117 = 'text=""'  # 
    SWIPER_PAGINATION_CUSTOM__ITEM = 'text=""'  # 
    SWIPER_PAGINATION_CUSTOM__ITEM_119 = 'text=""'  # 
    SWIPER_PAGINATION_CUSTOM__ITEM_120 = 'text=""'  # 
    ОШИБКА_НА_САЙТЕ = 'text="Ошибка на сайте"'  # Ошибка на сайте
    ОЦЕНИТЬ_САЙТ = 'text="Оценить сайт"'  # Оценить сайт
    ОТЗЫВ_О_САЙТЕ = 'text="Отзыв о сайте"'  # Отзыв о сайте
    РУССКИЙ = 'text="Русский"'  # Русский
    ПОНЯТНО = 'text="Понятно"'  # Понятно